Revit 2027 API
ReinforcementSettings.GetReinforcementAbbreviationTags Method
 Gets a list of abbreviation tags for desired reinforcement object type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ReinforcementAbbreviationTag> GetReinforcementAbbreviationTags(
	ReinforcementAbbreviationObjectType objectType
)
Public Function GetReinforcementAbbreviationTags (
	objectType As ReinforcementAbbreviationObjectType
) As IList(Of ReinforcementAbbreviationTag)
public:
IList<ReinforcementAbbreviationTag^>^ GetReinforcementAbbreviationTags(
	ReinforcementAbbreviationObjectType objectType
)
member GetReinforcementAbbreviationTags :
        objectType : ReinforcementAbbreviationObjectType -> IList<ReinforcementAbbreviationTag>
Parameters
objectType ReinforcementAbbreviationObjectType
 Defines the type of desired reinforcement object for abbreviation tags.
Return Value
IList<ReinforcementAbbreviationTag>
 An array of ReinforcementAbbreviationTag that will define all abbreviations for given reinforcement object.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace